#+title: Address already in use
#+subtitle: lsof
#+tags[]: network
#+date: 2024-03-22T23:06:38

If you want to see which process is listening on a certain port, use
=lsof=.  For example, looking for what's running on =9292= is:

#+begin_src bash :results output
  lsof -i :9292
#+end_src

#+RESULTS:
: COMMAND   PID    USER   FD   TYPE             DEVICE SIZE/OFF NODE NAME
: ruby    27467 wschenk   13u  IPv4 0x8cf71cd7f78517e3      0t0  TCP localhost:armtechdaemon (LISTEN)
: ruby    27467 wschenk   20u  IPv6 0x8cf71cdcbf525e93      0t0  TCP localhost:armtechdaemon (LISTEN)

And then you can kill it with

#+begin_src bash
  kill 27467
#+end_src
